{
    "title": "Pressão: Lançar Incompleto ou Atrasar Marketing?",
    "description": "Marketing agendou lançamento público com webinar de 500 pessoas e imprensa confirmada. Produto está 70% pronto com 4 bugs críticos. Decisão sua.",
    "type": "real_world_challenge",
    "difficulty": "intermediate",
    "xpReward": 18,
    "estimatedMinutes": 10,
    "isPremium": false,
    "order": 10,
    "isPublished": true,
    "content": {
        "context": {
            "role": "PM de novo produto (dentro de empresa estabelecida)",
            "team": "6 devs, 2 designers, 1 QA, 1 PM (você)",
            "deadline": "Lançamento público em 5 dias",
            "productReadiness": "70% das features planejadas implementadas",
            "company": "Startup B2B SaaS bem financiada, este é produto novo"
        },
        "trigger": {
            "from": "Head of Marketing (reunião de emergência)",
            "message": "Pessoal, situação crítica: Anúncio público já foi ao ar ontem. Webinar com 500 inscritos confirmado para daqui 5 dias. TechCrunch e Startupi vão cobrir. Campanha de ads rodando (R$50k investido). NÃO PODEMOS adiar. Produto está pronto?",
            "urgency": "critical",
            "context": "CEO aprovou lançamento sem consultar produto sobre readiness"
        },
        "currentState": {
            "ready": [
                "Login e autenticação (completo)",
                "Dashboard principal com overview (completo)",
                "2 dos 5 workflows principais funcionando (completo)",
                "Integrações básicas: Google, Microsoft (completo)"
            ],
            "missing": [
                "3 workflows prometidos na landing page",
                "Sistema de exports (CSV, PDF)",
                "Integrações Salesforce e HubSpot (anunciadas)",
                "Aplicativo mobile (citado em campanha)",
                "Relatórios avançados"
            ],
            "bugs": {
                "total": 12,
                "critical": 4,
                "details": "Crash ao processar >1000 registros, lentidão em datasets grandes, problema de permissões, falha intermitente em webhook"
            }
        },
        "detailedData": {
            "expectations": "Landing page e campanha prometem '5 workflows completos', 'integra com todo seu stack', 'relatórios poderosos'",
            "webinarAttendees": "500 inscritos (40% prospects quentes, 30% clientes atuais curiosos, 30% imprensa/comunidade)",
            "marketingInvestment": "R$50k em ads + R$30k em produção de conteúdo",
            "prReach": "Matérias podem alcançar 100k+ pessoas no setor",
            "competitiveContext": "Concorrente principal lançou produto similar 2 meses atrás com sucesso"
        },
        "options": [
            {
                "id": "a",
                "title": "Lançar do jeito que está (70% pronto, com bugs)",
                "details": "Faz o webinar, libera acesso, torce para dar certo.",
                "risk": "Primeiras impressões ruins. Reviews negativas. Dano à marca. Bugs podem viralizar negativamente. Prospects importantes desistem. NPS inicial péssimo.",
                "benefit": "Cumpre deadline. Marketing acontece conforme planejado. Não 'desperdiça' R$80k investidos. CEO feliz."
            },
            {
                "id": "b",
                "title": "Adiar 2 semanas, entregar produto polido",
                "details": "Cancela webinar e comunicação pública. Pede 2 semanas para completar.",
                "risk": "Cancelar 500 pessoas = péssima imagem. 'Desperdiçar' R$80k marketing. Prospects esfriam. Imprensa perde interesse. CEO e marketing furiosos. Concorrente ganha espaço.",
                "benefit": "Primeira impressão impecável. Produto sólido. Reviews positivas. NPS alto desde dia 1. Constrói reputação forte."
            },
            {
                "id": "c",
                "title": "Soft launch: beta privado para 50 early adopters selecionados",
                "details": "Webinar vira 'early access announcement'. Seleciona 50 melhores prospects para beta fechado.",
                "risk": "Marketing não terá números grandes para imprensa. Momentum menor. Alguns inscritos frustrados por não ter acesso imediato.",
                "benefit": "Feedback real antes de explosão pública. Tempo para polir com input de usuários. Cria FOMO ('exclusive beta'). Bugs resolvidos antes de escala."
            },
            {
                "id": "d",
                "title": "Lançar MVP transparente + roadmap público claro",
                "details": "Admite que é V1 com 2 workflows. Mostra roadmap semana a semana. Convida para co-criar.",
                "risk": "Admitir incompletude pode afastar alguns. Expectativa desalinhada (prometeu 5, entrega 2).",
                "benefit": "Transparência gera confiança. Early adopters se engajam. Roadmap público cria accountability. Community-driven development. Honestidade = diferencial."
            }
        ],
        "expertFeedback": {
            "name": "Bruno Nardon",
            "title": "Fundador e ex-CEO",
            "company": "Movile (iFood, PlayKids))",
            "photo": "expert-bruno",
            "selectedOption": "c",
            "feedback": {
                "intro": "Soft launch é sabedoria. Primeira impressão não tem segunda chance. Veja como fazer:",
                "strategy": [
                    "Stakeholder management URGENTE: Reunião com CEO + CMO HOJE. Dados na mesa: '70% pronto + bugs críticos = reviews ruins = dano permanente'.",
                    "Reposicione marketing: 'Exclusive Early Access' é MAIS sexy que 'General Launch'. Scarcity cria valor.",
                    "Selecione 50 ceticamente: 20 prospects tier-1, 20 clientes atuais engajados, 10 influencers/imprensa. Acesso VIP.",
                    "Webinar vira 'Vision + Roadmap + Early Access'. Mostra futuro, não só presente. Gera FOMO."
                ],
                "timeline": [
                    "Semana 1-2: 50 early adopters usam, feedback intenso, bugs resolvidos, features ajustadas.",
                    "Semana 3: Case studies com os 50. Testimonials. Prova social.",
                    "Semana 4: General launch com produto polido + social proof dos early adopters. Reviews já são positivas."
                ],
                "communication": "Email para 500 inscritos: 'Thank you! Decisão estratégica: vamos fazer certo, não rápido. Selected 50 early access (veja se você entrou). Resto: acesso em 3 semanas com produto ainda melhor.' 70%+ vão RESPEITAR."
            }
        },
        "learningPoints": [
            "Marketing e Produto precisam alinhar ANTES de anúncios públicos. Estabeleça processo.",
            "Primeira impressão é permanente em SaaS B2B. Vale mais esperar e impressionar.",
            "Soft launch não é fraqueza, é estratégia. Muitos grandes produtos lançaram assim.",
            "'Launch' é momento, não dia único. Pode ser ondas (beta → early access → general availability)."
        ],
        "stats": {
            "a": 15,
            "b": 25,
            "c": 40,
            "d": 20
        }
    }
}